{
    "TEST1_TITLE": "Prueba 1 - Formulario",
    "LANGUAGE": "Idioma",
    "SPANISH": "Español",
    "ENGLISH": "Inglés",
    "TEST_TITLE": "Prueba de desarrollador avanzada",
    "TEST_SUBTITLE": "Esta es Su prueba técnica de acceso para ser un desarrollador de AngularJS para Ricoh. En las siguientes pestañas, indicamos los procedimientos a seguir y lo que estamos buscando como desarrollador en AngularJS.",
    "INTRODUCTION": "Introducción",
    "TESTS": "Pruebas",
    "ADITIONAL_INFO": "Información adicional",
    "INTRODUCTION_TEXT": "<p>Está a punto de comenzar a realizar la prueba técnica que Ricoh propone para el reclutamiento de desarrolladores de AngularJS.</p><p> Esta prueba consta de 4 pruebas independientes que consisten en el desarrollo de una tabla, el desarrollo de un formulario, el desarrollo de un panel de resumen e implementación en varios idiomas. Estas cuatro pruebas se explican detalladamente en las siguientes pestañas.</p><p>La calidad y el resultado de esta prueba tendrán un importante peso de decisión que el grupo de evaluadores tomará al evaluar su candidatura para ser parte de nuestro equipo.</p><p>Somos conscientes de que la prueba puede ser difícil de enfrentar dependiendo de la situación personal de la evaluación, ya que es extensa y requerirá gran parte de su tiempo libre. Pero la compensación será directamente proporcional a su resultado, por lo que solicitamos un esfuerzo adicional para la evaluación que será recompensada.</p><p>Finalmente, en caso de cualquier duda en la realización de esta prueba, póngase en contacto con nuestro equipo y lo resolveremos lo más rápido posible.</p><p>Atentamente, Sergio Cernuda Fdez, desarrollador de AngularJS en Ricoh. </p>",
    "TEST_1": "Prueba 1",
    "TEST_1_TITLE": "Formulario",
    "TEST_1_TEXT": "<p>Hacer un formulario que simule la inserción de un objeto en el json alojado en \"/resources/data/data.json\".</p><p>Cree todos los campos necesarios en el formulario para la simulación y trátelos correctamente desde el controlador.</p><p>Después de esto tienes dos opciones.</p><ul><li> Mostrar el objeto en la misma pantalla de formulario </li><li> Mostrar el objeto por consola </li></ul><p>El formulario se insertará en una nueva pestaña que deberá crear en el menú lateral con la configuración correcta y el uso de la biblioteca ui-router para la navegación.</p>",
    "TEST_2": "Prueba 2",
    "TEST_2A_TITLE": "1.a Hacer una tabla con ordenadores de sobremesa.",
    "TEST_2A_TEXT": "<p>Hacer una tabla de ordenadores de sobremesa con la información adjunta al json en la ruta \"/resources/data/data.json\". La tabla se insertará en una nueva pestaña que deberá crear en el menú lateral con la configuración correcta y el uso de la biblioteca ui-router para la navegación.</p>",
    "TEST_2B_TITLE": "1.b Hacer un carrusel con ordenadores portátiles.",
    "TEST_2B_TEXT": "<p>Hacer un carrusel de computadoras portátiles con la información adjunta al Json con la ruta \"/resources/data/data.json\". El carrusel se insertará en la misma pestaña de la tabla.</p>",
    "TEST_3": "Prueba 3",
    "TEST_3_TITLE": "Hacer un panel resumen.",
    "TEST_3_TEXT": "<p>En esta sección, proponemos la realización de un panel resumen con la información proporcionada dentro de los datos json. Puede ser el panel típico de información general que un usuario de tipo administrador vería como un resumen.</p><p>Para esta sección no ponemos ningún tipo de condición previa, le permitimos elegir el diseño y la funcionalidad de esta pantalla, siempre que sea coherente con el resto de la aplicación.</p><p>El panel de resumen se insertará en una nueva pestaña que deberá crear en el menú lateral con la configuración correcta y el uso de la biblioteca ui-router para la navegación.</p>",
    "TEST_4": "Prueba 4",
    "TEST_4A_TITLE": "1.a Hacer multilenguaje la aplicación.",
    "TEST_4A_TEXT": "<p> En esta sección, necesitamos que implemente el multilenguaje en la aplicación, como mínimo un idioma más que el inglés.</p><p>El idioma seleccionado se guardará en una cookie del navegador y se debe consultar al inicio de la aplicación.</p><p>Para esta sección, recomendamos el uso de la librería angular-translate.</p>",
    "TEST_4B_TITLE": "1.b No debe usar hardcode y literales en los controladores y html.",
    "TEST_4B_TEXT": "<p>Implementa un archivo que contenga todos los literales de todos los controladores, html y otros para cada idioma utilizado en la sección anterior.</p>",
    "ADDITIONAL_INFO_TITLE": "Información adicional",
    "ADDITIONAL_INFO_TEXT": "<p>En esta sección, le expondremos las cosas que valoraremos sobre la prueba que va a hacer:</p><ul><li>Código limpio.</li><li> Optimización de código. </li><li> Comentarios. </li><li> Originalidad de las soluciones desarrolladas. </li><li> El diseño correcto de la aplicación. </li><li> El uso correcto de las clases y estilos. </li><li> El tiempo necesario para realizar la prueba. </li><li> Cualquier mejora que el evaluado quiera insertar en la aplicación explicando las razones por las cuales se implementa. </li></ul><p>En caso de implementar una biblioteca externa, aparte de las que ponemos a su disposición, debe adjuntar un documento explicativo con la funcionalidad de esa biblioteca y la forma de uso dentro de la explicación.</p>",
    "BRAND": "Marca",
    "MODEL": "Modelo",
    "PRICE": "Precio",
    "CPU": "CPU",
    "RAM": "RAM",
    "TYPE": "Tipo",
    "SHAPE": "Forma",
    "IMAGE": "Imagen",
    "MULTIMEDIA": "Multimedia",
    "GAMING": "Gaming",
    "WORKSTATION": "Workstation",
    "ALL_IN_ONE": "Todo en uno",
    "DESKTOP": "Escritorio",
    "LAPTOP": "Portátil",
    "SAVE": "Guardar",
    "NEW_COMPUTER": "Nuevo ordenador",
    "SOLUTION_1_TEXT": "Con este formulario, puede añadir nuevos ordenadores. <i>Los campos marcados (<strong class=\"text-danger\">*</strong>) son obligatorios.</i>",
    "FORM_ERRORS": "Los campos obligatorios deben ser cubiertos.",
    "SOLUTION_2A_TITLE": "Prueba 2.a - Hacer una tabla con ordenadores de sobremesa.",
    "SOLUTION_2B_TITLE": "Prueba 2.b - Hacer un carrusel con ordenadores portátiles.",
    "SHOWING_FROM": "Mostrando desde",
    "TO": "hasta",
    "OF": "de",
    "ROWS_TO_SHOW": "Filas que mostrar",
    "SOLUTION_3_TITLE": "Prueba 3 - Hacer un panel resumen.",
    "SEARCH": "Buscar",
    "CONTACT_WITH_EVALUATOR": "Contacta con el evaluador",
    "CONTACT_INFO": "Si tiene alguna duda sobre el procedimiento de la prueba técnica, puede ponerse en contacto con su evaluador a través del siguiente correo electrónico:",
    "WELCOME": "Bienvenido",
    "TEST/INFO": "Prueba/Info",
    "YOUR_TEST_INFO": "Información de su prueba"
}