{
    "TEST1_TITLE": "Test 1 - Make a Form",
    "LANGUAGE": "Language",
    "SPANISH": "Spanish",
    "ENGLISH": "English",
    "TEST_TITLE": "Developer advanced Test",
    "TEST_SUBTITLE": "This is your access technical test to be an angular js developer for Ricoh. In the following tabs we indicate the procedures to do and what we are looking for as a developer in angularjs.",
    "INTRODUCTION": "Introduction",
    "TESTS": "Tests",
    "ADITIONAL_INFO": "Aditional info",
    "INTRODUCTION_TEXT": "<p>You are about to start performing the technical test that Ricoh proposes for the recruitment of Angularjs developers.</p><p>This test consists of 4 independent tests consisting of the development of a table, the development of a form, the development of a summary panel and implement multilanguage.These four tests are thoroughly explained in the following tabs.</p><p>The quality and result of this test will have an important weight of decision that the group of evaluators take when evaluating your candidacy to be part of our team.</p><p>We are aware that the test can be difficult to face depending on the personal situation of the evaluated, since it is extensive and will take much of your free time. But the compensation will be directly proportional to its result, so we ask for an extra effort to the evaluated that will be rewarded.</p><p>Finally, in case of any doubt in the realization of this test, get in touch with our team and we will solve it as quickly as possible.</p><p>Sincerely, Sergio Cernuda Fdez angularJs developer on Ricoh.</p>",
    "TEST_1": "Test 1",
    "TEST_1_TITLE": "Make a form.",
    "TEST_1_TEXT": "<p>Make a form that simulates inserting an object in the json hosted in \"/resources/data/data.json\".</p><p>Create all the necessary fields in the form for the simulation and treat them correctly from the controller.</p><p>After this you have two options</p><ul><li>Show the object on the same form screen</li><li>Show the object by console</li></ul><p>The form will be inserted in a new tab that you will have to create in the side menu with the correct configuration and using the ui-router library for navigation.</p>",
    "TEST_2": "Test 2",
    "TEST_2A_TITLE": "2.a Make a table with desktop computers.",
    "TEST_2A_TEXT": "<p>Make a table of desktop computers with the information attached to the Json with path \"/resources/data/data.json\". The table will be inserted in a new tab that you will have to create in the side menu with the correct configuration and using the ui-router library for navigation.</p>",
    "TEST_2B_TITLE": "2.b Make a carousel with laptop computers.",
    "TEST_2B_TEXT": "<p>Make a carousel of laptop computers with the information attached to the Json with path \"/resources/data/data.json\". The carousel will be inserted in the same tab of the table.</p>",
    "TEST_3": "Test 3",
    "TEST_3_TITLE": "Make a data summary panel",
    "TEST_3_TEXT": "<p>In this section we propose the realization of a summary panel with the information provided within the data json. It can be the typical panel of general information that a user of administrator type would see as a summary,</p><p>For this section we do not put any kind of precondition, we let you choose both the design and the functionality of this screen, as long as it is consistent with the rest of the application.</p><p>The summary panel will be inserted in a new tab that you will have to create in the side menu with the correct configuration and using the ui-router library for navigation.</p>",
    "TEST_4": "Test 4",
    "TEST_4A_TITLE": "4.a Make multilanguage the application",
    "TEST_4A_TEXT": "<p>In this section we need you to implement multilanguage in the application, minimum one language more than English.</p><p>The selected language will be saved in a browser cookie and should be consulted at the start of the application.</p><p>For this section we recommend the use of the angular-translate library.</p>",
    "TEST_4B_TITLE": "4.b You musn´t use hardcode and literals in the controllers and html.",
    "TEST_4B_TEXT": "<p>Implements a constant file that contains all the literals of all controllers and html and another for each language used in the previous section.</p>",
    "ADDITIONAL_INFO_TITLE": "Additional information",
    "ADDITIONAL_INFO_TEXT": "<p>In this section we will expose you the things that we will value about the test you are going to do:</p><ul><li>Clean Code.</li><li>Code optimization.</li><li>Code Coments.</li><li>Originality of the developed solutions.</li><li>The correct layout of the application.</li><li>The correct use of the classes and styles.</li><li>The time taken to perform the test.</li><li>Any improvement that the evaluated one wants to insert in the application explaining the reasons for which the implement.</li></ul><p>In case of implementing an external library, other than those that we put at your disposal, you must attach an explanatory document with the functionality of that library and the way of use within the explanation.</p>",
    "BRAND": "Brand",
    "MODEL": "Model",
    "PRICE": "Price",
    "CPU": "CPU",
    "RAM": "RAM",
    "TYPE": "Type",
    "SHAPE": "Shape",
    "IMAGE": "Image",
    "MULTIMEDIA": "Multimedia",
    "GAMING": "Gaming",
    "WORKSTATION": "Workstation",
    "ALL_IN_ONE": "All in one",
    "DESKTOP": "Desktob",
    "LAPTOP": "Laptop",
    "SAVE": "Save",
    "NEW_COMPUTER": "New computer",
    "SOLUTION_1_TEXT": "In this form, you can add new computers. <i>Fields <strong class=\"text-danger\">*</strong> are required.</i>",
    "FORM_ERRORS": "Required fields must be filled in.",
    "SOLUTION_2A_TITLE": "Test 2.a - Make a table with desktop computers.",
    "SOLUTION_2B_TITLE": "Test 2.b - Make a carousel with laptop computers.",
    "SHOWING_FROM": "Showing from",
    "TO": "to",
    "OF": "of",
    "ROWS_TO_SHOW": "Rows to show",
    "SOLUTION_3_TITLE": "Test 3 - Make a summary panel.",
    "SEARCH": "Search",
    "CONTACT_WITH_EVALUATOR": "Contact with evaluator",
    "CONTACT_INFO": "If you have any doubts about the procedure of the technical test you can contact your evaluator through the email that we enclose here:",
    "WELCOME": "Welcome",
    "TEST/INFO": "Test/Info",
    "YOUR_TEST_INFO": "Your test info"
}